[
  "Why don’t skeletons fight each other? They don’t have the guts.",
  "I told my computer I needed a break, and it said 'No problem — I’ll go to sleep.'",
  "Why was the math book sad? It had too many problems.",
  "Parallel lines have so much in common… it’s a shame they’ll never meet.",
  "Why do programmers prefer dark mode? Because light attracts bugs.",
  "I ate a clock yesterday. It was very time-consuming.",
  "Why did the scarecrow win an award? Because he was outstanding in his field.",
  "Why did the bicycle fall over? It was two-tired.",
  "How do you organize a space party? You planet.",
  "What do you call fake spaghetti? An impasta.",
  "Why can’t your nose be 12 inches long? Because then it’d be a foot.",
  "What do you call a factory that makes good products? A satisfactory.",
  "Why do cows wear bells? Because their horns don’t work.",
  "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
  "I only know 25 letters of the alphabet. I don’t know y.",
  "Why don’t eggs tell jokes? They might crack up.",
  "Why did the computer show up at work late? It had a hard drive.",
  "What do you call cheese that isn't yours? Nacho cheese.",
  "Why did the tomato blush? Because it saw the salad dressing.",
  "Why can’t you hear a pterodactyl in the bathroom? Because it has a silent pee.",
  "Why did the cat sit on the computer? To keep an eye on the mouse.",
  "Why did the smartphone go to school? It wanted to improve its 'cell'-f.",
  "Why don’t some couples go to the gym? Because some relationships don’t work out.",
  "Why do seagulls fly over the sea? Because if they flew over the bay, they’d be bagels.",
  "What did one wall say to the other? I'll meet you at the corner.",
  "Why did the chicken join a band? Because it had the drumsticks.",
  "What do you call a snowman with a six-pack? An abdominal snowman.",
  "What do you call a belt made out of watches? A waist of time.",
  "What did the zero say to the eight? Nice belt!",
  "What do you call a sleeping bull? A bulldozer.",
  "Why did the picture go to jail? It was framed.",
  "What do you call a boomerang that won’t come back? A stick.",
  "Why do bananas never get lonely? Because they hang out in bunches.",
  "Why can’t your hand be 12 inches long? Because then it’d be a foot.",
  "Why don’t scientists trust atoms? Because they make up everything.",
  "What do you call a fish with no eyes? Fsh.",
  "Why did the man put his money in the blender? He wanted liquid assets.",
  "What did the janitor say when he jumped out of the closet? Supplies!",
  "What do you call a bear with no teeth? A gummy bear.",
  "Why did the coffee file a police report? It got mugged.",
  "Why did the cookie go to the doctor? It was feeling crumby.",
  "Why was the computer cold? It forgot to close its Windows.",
  "Why did the frog take the bus to work? His car got toad.",
  "Why did the cow go to outer space? To see the moooon.",
  "Why do ducks have feathers? To cover their buttquacks.",
  "Why did the man run around his bed? He wanted to catch up on sleep.",
  "Why do bees have sticky hair? They use honeycombs.",
  "Why was six afraid of seven? Because 7 8 9.",
  "Why did the bicycle stand up by itself? It was two-tired.",
  "Why can’t you trust a ladder? It’s always up to something.",
  "Why did the belt get arrested? It was holding up pants.",
  "Why did the mushroom go to the party? Because he was a fungi.",
  "Why did the stadium get hot? All the fans left.",
  "Why did the broom get promoted? It swept the competition.",
  "Why did the barber win the race? He knew all the shortcuts.",
  "Why was the math lecture so long? The professor kept going off on a tangent.",
  "Why don’t oysters donate to charity? Because they are shellfish.",
  "Why did the computer break up with the internet? There was no connection.",
  "Why do ghosts love elevators? They lift their spirits.",
  "Why was the calendar afraid? Its days were numbered.",
  "Why did the music teacher go to the principal’s office? She found herself in treble.",
  "Why did the bank teller lose his job? He lost interest.",
  "Why did the bicycle stop? It was two-tired.",
  "Why did the chicken go to the seance? To talk to the other side.",
  "Why did the man eat his lightbulb? He wanted a light snack.",
  "Why did the scarecrow get promoted? He was outstanding in his field.",
  "Why did the boy bring a ladder to school? He wanted to go to high school.",
  "Why did the clock get kicked out of class? It tocked too much.",
  "Why did the teacher wear sunglasses? Her students were too bright.",
  "Why did the man put his car in the oven? He wanted a hot rod.",
  "Why did the golfer bring extra socks? In case of a hole in one.",
  "Why did the robot go on a diet? Too many bytes.",
  "Why did the phone go to therapy? It lost its touch.",
  "Why did the fish blush? It saw the ocean’s bottom.",
  "Why was the broom late? It swept in.",
  "Why did the tomato turn red? It saw the salad dressing.",
  "Why did the fridge blush? It saw the salad undressing.",
  "Why did the chicken join the comedy club? To crack people up.",
  "Why did the spider go to school? To learn web design.",
  "Why did the cat join Instagram? To get more pawsitive attention.",
  "Why did the duck go to the doctor? He felt a bit under the feather.",
  "Why did the turtle cross the road? To get to the shell station.",
  "Why did the cow sit in the corner? It was feeling a little mooo-dy.",
  "Why did the balloon go to the party alone? It didn’t want to be tied down.",
  "Why did the pillow go to the doctor? It was feeling down.",
  "Why did the light bulb fail school? It wasn’t too bright.",
  "Why did the banana go to the hospital? It wasn’t peeling well.",
  "Why did the baker go to therapy? He kneaded it.",
  "Why did the rope go to the party? It wanted to tie one on.",
  "Why did the squirrel sit on the computer? To keep an eye on the mouse.",
  "Why did the key go to school? It wanted to be a smart key.",
  "Why did the book go to the hospital? It broke its spine.",
  "Why did the pencil go to the principal’s office? It was acting a little sketchy."
]
